Revit 2027 API
ParameterTypeId.RebarModelBarDiameter Property
 "Model Bar Diameter"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarModelBarDiameter { get; }
Public Shared ReadOnly Property RebarModelBarDiameter As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarModelBarDiameter {
	ForgeTypeId^ get ();
}
static member RebarModelBarDiameter : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace